Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
  resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonrabbitmqs
              - kuberoaddonrabbitmqs/status
              - kuberoaddonrabbitmqs/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmongodbs
              - kuberoaddonmongodbs/status
              - kuberoaddonmongodbs/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmemcacheds
              - kuberoaddonmemcacheds/status
              - kuberoaddonmemcacheds/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[42] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-metrics-reader"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              name: kubero-operator-metrics-reader
            rules:
            - nonResourceURLs:
              - /metrics
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[43] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-proxy-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              name: kubero-operator-proxy-role
            rules:
            - apiGroups:
              - authentication.k8s.io
              resources:
              - tokenreviews
              verbs:
              - create
            - apiGroups:
              - authorization.k8s.io
              resources:
              - subjectaccessreviews
              verbs:
              - create
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[44] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "RoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-leader-election-rolebinding"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              name: kubero-operator-leader-election-rolebinding
              namespace: kubero-operator-system
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: kubero-operator-leader-election-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[45] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-manager-rolebinding"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: kubero-operator-manager-rolebinding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: kubero-operator-manager-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[46] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-proxy-rolebinding"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: kubero-operator-proxy-rolebinding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: kubero-operator-proxy-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[47] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-manager-config"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              controller_manager_config.yaml: |
                apiVersion: controller-runtime.sigs.k8s.io/v1alpha1
                kind: ControllerManagerConfig
                health:
                  healthProbeBindAddress: :8081
                metrics:
                  bindAddress: 127.0.0.1:8080
            
                leaderElection:
                  leaderElect: true
                  resourceName: 811c9dc5.kubero.dev
            kind: ConfigMap
            metadata:
              name: kubero-operator-manager-config
              namespace: kubero-operator-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[48] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager-metrics-service"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                control-plane: controller-manager
              name: kubero-operator-controller-manager-metrics-service
              namespace: kubero-operator-system
            spec:
              ports:
              - name: https
                port: 8443
                protocol: TCP
                targetPort: https
              selector:
                control-plane: controller-manager
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[49] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: controller-manager
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system
            spec:
              replicas: 1
              selector:
                matchLabels:
                  control-plane: controller-manager
              template:
                metadata:
                  annotations:
                    kubectl.kubernetes.io/default-container: manager
                  labels:
                    control-plane: controller-manager
                spec:
                  containers:
                  - args:
                    - --secure-listen-address=0.0.0.0:8443
                    - --upstream=http://127.0.0.1:8080/
                    - --logtostderr=true
                    - --v=0
                    image: gcr.io/kubebuilder/kube-rbac-proxy:v0.11.0
                    name: kube-rbac-proxy
                    ports:
                    - containerPort: 8443
                      name: https
                      protocol: TCP
                    resources:
                      limits:
                        cpu: 500m
                        memory: 128Mi
                      requests:
                        cpu: 5m
                        memory: 64Mi
                  - args:
                    - --health-probe-bind-address=:8081
                    - --metrics-bind-address=127.0.0.1:8080
                    - --leader-elect
                    - --leader-election-id=kubero-operator
                    - --zap-log-level=info
                    image: ghcr.io/kubero-dev/kubero-operator/kuberoapp:v0.2.2
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 8081
                      initialDelaySeconds: 15
                      periodSeconds: 20
                    name: manager
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 8081
                      initialDelaySeconds: 5
                      periodSeconds: 10
                    resources:
                      limits:
                        cpu: 1000m
                        memory: 1Gi
                      requests:
                        cpu: 100m
                        memory: 64Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                  securityContext:
                    runAsNonRoot: true
                  serviceAccountName: kubero-operator-controller-manager
                  terminationGracePeriodSeconds: 10
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_cluster_role_binding.dashboard_admin will be created
+ resource "kubernetes_cluster_role_binding" "dashboard_admin" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dashboard-admin"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "dashboard-admin"
          + namespace = "kubernetes-dashboard"
        }
    }

  # kubernetes_ingress_v1.dashboard will be created
+ resource "kubernetes_ingress_v1" "dashboard" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer"                      = "letsencrypt-prod"
              + "traefik.ingress.kubernetes.io/router.tls"            = "true"
              + "traefik.ingress.kubernetes.io/service.serversscheme" = "https"
            }
          + generation       = (known after apply)
          + name             = "kubernetes-dashboard"
          + namespace        = "kubernetes-dashboard"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "traefik"

          + rule {
              + host = "i-kdashboard.truealpha.club"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "kubernetes-dashboard-kong-proxy"

                              + port {
                                  + number = 443
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "i-kdashboard.truealpha.club",
                ]
              + secret_name = "dashboard-tls"
            }
        }
    }

  # kubernetes_ingress_v1.infisical will be created
+ resource "kubernetes_ingress_v1" "infisical" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
            }
          + generation       = (known after apply)
          + name             = "infisical-ingress"
          + namespace        = "security"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "traefik"

          + rule {
              + host = "i-secrets.truealpha.club"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "infisical-infisical-standalone-infisical"

                              + port {
                                  + number = 8080
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "i-secrets.truealpha.club",
                ]
              + secret_name = "infisical-tls"
            }
        }
    }

  # kubernetes_namespace.dashboard will be created
+ resource "kubernetes_namespace" "dashboard" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "kubernetes-dashboard"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.kubero will be created
+ resource "kubernetes_namespace" "kubero" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "kubero"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.kubero_operator_system will be created
+ resource "kubernetes_namespace" "kubero_operator_system" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "control-plane" = "controller-manager"
            }
          + name             = "kubero-operator-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.security will be created
+ resource "kubernetes_namespace" "security" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "security"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.dashboard_admin_token will be created
+ resource "kubernetes_secret" "dashboard_admin_token" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/service-account-token"
      + wait_for_service_account_token = true

      + metadata {
          + annotations      = {
              + "kubernetes.io/service-account.name" = "dashboard-admin"
            }
          + generation       = (known after apply)
          + name             = "dashboard-admin-token"
          + namespace        = "kubernetes-dashboard"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.infisical_secrets will be created
+ resource "kubernetes_secret" "infisical_secrets" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "infisical-secrets"
          + namespace        = "security"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.dashboard will be created
+ resource "kubernetes_service_account" "dashboard" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kubernetes-dashboard"
          + namespace        = "kubernetes-dashboard"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.dashboard_admin will be created
+ resource "kubernetes_service_account" "dashboard_admin" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dashboard-admin"
          + namespace        = "kubernetes-dashboard"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_id.infisical_encryption_key will be created
+ resource "random_id" "infisical_encryption_key" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.infisical_jwt_auth_secret will be created
+ resource "random_id" "infisical_jwt_auth_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.infisical_jwt_mfa_secret will be created
+ resource "random_id" "infisical_jwt_mfa_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.infisical_jwt_provider_secret will be created
+ resource "random_id" "infisical_jwt_provider_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.infisical_jwt_refresh_secret will be created
+ resource "random_id" "infisical_jwt_refresh_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.infisical_jwt_service_secret will be created
+ resource "random_id" "infisical_jwt_service_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.infisical_jwt_signup_secret will be created
+ resource "random_id" "infisical_jwt_signup_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.kubero_session_secret will be created
+ resource "random_id" "kubero_session_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 73 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ dashboard_port_forward_command    = "kubectl -n kubernetes-dashboard port-forward svc/kubernetes-dashboard-kong-proxy 8443:443"
+ dashboard_token_command           = "kubectl -n kubernetes-dashboard get secret dashboard-admin-token -o jsonpath='{.data.token}' | base64 -d"
+ dashboard_url                     = "https://i-kdashboard.truealpha.club"
+ infisical_access_via_port_forward = "kubectl -n security port-forward svc/infisical-backend 8080:8080"
+ infisical_endpoint                = "infisical-backend.security.svc.cluster.local:8080"
+ kubero_session_secret             = (sensitive value)
+ kubero_ui_url                     = "https://i-kcloud.truealpha.club"
+ postgresql_database               = "infisical"
+ postgresql_endpoint               = "postgresql.security.svc.cluster.local:5432"
+ postgresql_user                   = "infisical"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://i-atlantis.truealpha.club/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 73 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`